ConfigurationServiceDesk/src/InformationRegisters/НастройкиSLA/НастройкиSLA.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиSLA</name>
  <resources>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРешения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчитыватьНерабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяЗавершенияРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СдвигПриоритета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.СервисыИТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/ОбращениеПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеПользователя</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.СервисыИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителей</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияВРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ПользователиИТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationServiceDesk/src/Catalogs/СтатусыОбращений/СтатусыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбращений</name>
  <predefined>
    <items>
      <name>Новое</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Назначено</name>
      <description>Назначено</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа</description>
    </items>
    <items>
      <name>Решено</name>
      <description>Решено</description>
    </items>
    <items>
      <name>Закрыто</name>
      <description>Закрыто</description>
    </items>
    <items>
      <name>Переоткрыто</name>
      <description>Переоткрыто</description>
    </items>
    <items>
      <name>Отклонено</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>НаПодтверждении</name>
      <description>На подтверждении</description>
    </items>
  </predefined>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветДляИнтерфейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConfigurationServiceDesk/src/CommonModules/ФоновыеЗаданияСервисДеск/Module.bsl
Процедура ПроверитьПросрочкуSLA() Экспорт
  
  // 1. Подготовка ссылок на статусы
  СтатусНазначено = Справочники.СтатусыОбращений.НайтиПоНаименованию("Назначено");
  СтатусНовое     = Справочники.СтатусыОбращений.НайтиПоНаименованию("Новое");
  
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    |  ОбращениеПользователя.Ссылка КАК Ссылка,
    |  ОбращениеПользователя.Сервис КАК Сервис,
    |  ОбращениеПользователя.Приоритет КАК Приоритет,
    |  ОбращениеПользователя.Дата КАК Дата,
    |  ОбращениеПользователя.Проведен КАК Проведен
    |ИЗ
    |  Документ.ОбращениеПользователя КАК ОбращениеПользователя
    |ГДЕ
    |  ОбращениеПользователя.СрокРеакции < &ТекущаяДата
    |  И (ОбращениеПользователя.Статус = &СтатусНазначено 
    |  ИЛИ ОбращениеПользователя.Статус = &СтатусНовое)";
  
  Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
  Запрос.УстановитьПараметр("СтатусНазначено", СтатусНазначено);
  Запрос.УстановитьПараметр("СтатусНовое", СтатусНовое);
  
  Результат = Запрос.Выполнить().Выбрать();
  
  Пока Результат.Следующий() Цикл
    
    Объект = Результат.Ссылка.ПолучитьОбъект();
    
    // 2. Получаем настройки сдвига из регистра
    Отбор = Новый Структура("Сервис, Приоритет", Результат.Сервис, Результат.Приоритет);
    Настройки = РегистрыСведений.НастройкиSLA.Получить(Отбор);
    
    // Проверяем, что сдвиг настроен в регистре (не равен 0)
    Если Настройки.СдвигПриоритета > 0 Тогда
      
      // Математика: получаем числовой номер нового приоритета
      ТекущийНомер = Число(Объект.Приоритет.Код);
      НовыйНомер = ТекущийНомер - Настройки.СдвигПриоритета;
      
      // Защита от выхода за границы (P1 - самый высокий)
      Если НовыйНомер < 1 Тогда 
        НовыйНомер = 1; 
      КонецЕсли;
      
      // 3. КОНКАТЕНАЦИЯ: приклеиваем 8 нулей и берем правые 9 знаков
      // Формат(..., "ЧГ=0") убирает невидимый пробел-разделитель тысяч
      СтрокаНомера = Формат(НовыйНомер, "ЧГ=0");
      НовыйКод = Прав("00000000" + СтрокаНомера, 9);
      
      НайденныйПриоритет = Справочники.Приоритеты.НайтиПоКоду(НовыйКод);
      
      Если Не НайденныйПриоритет.Пустая() И Объект.Приоритет <> НайденныйПриоритет Тогда
        
        Объект.Приоритет = НайденныйПриоритет;
        
        // 4. Пересчет сроков SLA под новый приоритет
        Попытка
          СЛА = СерверСервисДеск.РассчитатьSLA(Объект.Сервис, Объект.Приоритет, Объект.Дата);
          Объект.СрокРеакции = СЛА.СрокРеакции;
          Объект.СрокРешения = СЛА.СрокРешения;
        Исключение
          // Если в модуле расчета SLA есть ошибки, запишем хотя бы смену приоритета
        КонецПопытки;
        
        // 5. Запись документа (сохраняем статус Проведен/Нет)
        Если Объект.Проведен Тогда
          Объект.Записать(РежимЗаписиДокумента.Проведение);
        Иначе
          Объект.Записать(РежимЗаписиДокумента.Запись);
        КонецЕсли;
        
        Сообщить("Документ " + Объект.Номер + ": приоритет повышен до " + НайденныйПриоритет.Наименование);
        
      ИначеЕсли НайденныйПриоритет.Пустая() Тогда
        Сообщить("Ошибка: Не найден приоритет с кодом [" + НовыйКод + "]");
      КонецЕсли;
      
    КонецЕсли;
    
  КонецЦикла;
  
КонецПроцедуры
